app/views/patients/show.html.erb

SELECT "requests".* FROM "requests" WHERE "requests"."patient_id" = ?  [["patient_id", 1]]
---
  </thead>
<% @patient.requests.each do |request| %>