app/controllers/patients_controller.rb

SELECT "patients".* FROM "patients" WHERE (lastname = 'kelly') ORDER BY created_at ASC
---
  def index
    @patients = Patient.all

INSERT INTO "patients" ("firstname", "lastname", "dob", "complaint", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @patient = Patient.new(patient_params)
logger = MyLogger.send :new
logger.logInformation("A new patient has been added: "+@patient.firstname+","+@patient.lastname+" at "+Time.now.to_s)

    respond_to do |format|
      if @patient.save

UPDATE "patients" SET "complaint" = ?, "updated_at" = ? WHERE "patients"."id" = ?  [["complaint", "Migraine"], ["updated_at", 2017-04-09 08:45:48 UTC], ["id", 2]]
---
  def update
    respond_to do |format|
      if @patient.update(patient_params)

DELETE FROM "patients" WHERE "patients"."id" = ?  [["id", 1]]
---
  def destroy
    @patient.destroy