app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("firstname", "lastname", "address", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["firstname", "Tony"], ["lastname", "theTiger"], ["address", "jungle"], ["user_id", 2], ["created_at", 2017-04-09 11:53:28 UTC], ["updated_at", 2017-04-09 11:53:28 UTC]]
---
  def create
    @profile = Profile.new(profile_params)


    respond_to do |format|
      if @profile.save

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
---
def signedinuserprofile profile = Profile.find_by_user_id(current_user.id)
 if profile.nil?
redirect_to "/profiles/new"
else
@profile = Profile.find_by_user_id(current_user.id)