app/controllers/requests_controller.rb

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
@patient = Patient.find(params[:patient_id])

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "requests".* FROM "requests" WHERE "requests"."patient_id" = ? AND "requests"."id" = ? LIMIT ?  [["patient_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def show
@patient = Patient.find(params[:patient_id])
@request = @patient.requests.find(params[:id])

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
@patient = Patient.find(params[:patient_id])

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "requests" ("procedure", "specialist", "status", "patient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["procedure", ""], ["specialist", ""], ["status", "Select One"], ["patient_id", 4], ["created_at", 2017-04-11 15:22:04 UTC], ["updated_at", 2017-04-11 15:22:04 UTC]]
---
def create
@patient = Patient.find(params[:patient_id])
@request = @patient.requests.build(params.require(:request).permit(:procedure, :specialist, :status, :date))
if @request.save

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "requests".* FROM "requests" WHERE "requests"."patient_id" = ? AND "requests"."id" = ? LIMIT ?  [["patient_id", 1], ["id", 3], ["LIMIT", 1]]
---
  def edit
@patient = Patient.find(params[:patient_id])
@request = @patient.requests.find(params[:id])

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "requests" SET "status" = ?, "updated_at" = ? WHERE "requests"."id" = ?  [["status", "Select One"], ["updated_at", 2017-04-11 14:58:49 UTC], ["id", 6]]
---
def update
@patient = Patient.find(params[:patient_id])
@request = Request.find(params[:id])
if @request.update_attributes(params.require(:request).permit(:procedure, :specialist, :status, :date))

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 1]]
---
def destroy
@patient = Patient.find(params[:patient_id])
@request = Request.find(params[:id])
@request.destroy